huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms
# huaweiwx@sina.com 2018.10.12

menu.cpu=Processor
#menu.startadr=Startup adr
menu.clock_source=Clock source
menu.osc_speed=OSC Speed(MHz)
menu.cpu_speed=CPU Speed(MHz)
menu.serial=Serial communication
menu.upload_method=Upload method
menu.log=Debug Log_level

#################################################################
#                       nuvoton m480                            #
#################################################################
M480.name=M481/2/3/4

M480.build.core=nuvoton
M480.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
M480.build.f_cpu=192000000L
M480.build.series=M480
M480.build.variant=M480
M480.build.board=M480

M480.menu.cpu.M481SI=NuMaker_M481SI(LQP64)(512kFLASH 160kRAM)
M480.menu.cpu.M481SI.build.extra_flags0=-DCHIP64P -DM481S
M480.menu.cpu.M481SI.build.board=GENERIC_M481S
M480.menu.cpu.M481SI.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.M481SI.upload.maximum_size=524288
M480.menu.cpu.M481SI.upload.maximum_data_size=163840

#M480.menu.cpu.M481SG=GENERIC_M481SG(LQP64)(256kFLASH 96kRAM)
#M480.menu.cpu.M481SG.build.extra_flags0=-DCHIP64P -DM481S
#M480.menu.cpu.M481SG.build.board=GENERIC_M481S
#M480.menu.cpu.M481SG.build.ldscript=256K_96K_flash_S.ld
#M480.menu.cpu.M481SG.upload.maximum_size=262144
#M480.menu.cpu.M481SG.upload.maximum_data_size=98304

M480.menu.cpu.M481LI=GENERIC_M481LI(LQP48)(512kFLASH 160kRAM)
M480.menu.cpu.M481LI.build.extra_flags0=-DCHIP48P -DM481L
M480.menu.cpu.M481LI.build.board=GENERIC_M481L
M480.menu.cpu.M481LI.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.M481LI.upload.maximum_size=524288
M480.menu.cpu.M481LI.upload.maximum_data_size=163840

#M480.menu.cpu.M481LG=GENERIC_M481LG(LQP48)(256kFLASH 96kRAM)
#M480.menu.cpu.M481LG.build.extra_flags0=-DCHIP48P -DM481L
#M480.menu.cpu.M481LG.build.board=GENERIC_M481L
#M480.menu.cpu.M481LG.build.ldscript=256K_96K_flash_S.ld
#M480.menu.cpu.M481LG.upload.maximum_size=262144
#M480.menu.cpu.M481LG.upload.maximum_data_size=98304

M480.menu.cpu.M481ZI=GENERIC_M481ZI(QFN33)(512kFLASH 160kRAM)
M480.menu.cpu.M481ZI.build.extra_flags0=-DCHIP33P -DM481Z
M480.menu.cpu.M481ZI.build.board=GENERIC_M481Z
M480.menu.cpu.M481ZI.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.M481ZI.upload.maximum_size=524288
M480.menu.cpu.M481ZI.upload.maximum_data_size=163840

#M480.menu.cpu.M481ZG=GENERIC_M481ZG(QFN33)(256kFLASH 96kRAM)
#M480.menu.cpu.M481ZG.build.extra_flags0=-DCHIP33P -DM481Z
#M480.menu.cpu.M481ZG.build.board=GENERIC_M481Z
#M480.menu.cpu.M481ZG.build.ldscript=256K_96K_flash_S.ld
#M480.menu.cpu.M481ZG.upload.maximum_size=262144
#M480.menu.cpu.M481ZG.upload.maximum_data_size=98304

M480.menu.cpu.M482KI=GENERIC_M482KI(LQP128)(512kFLASH 160kRAM)
M480.menu.cpu.M482KI.build.extra_flags0=-DCHIP128P -DM482K
M480.menu.cpu.M482KI.build.board=GENERIC_M482K
M480.menu.cpu.M482KI.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.M482KI.upload.maximum_size=524288
M480.menu.cpu.M482KI.upload.maximum_data_size=163840

#M480.menu.cpu.M482KG=GENERIC_M482KG(LQP128)(256kFLASH 96kRAM)
#M480.menu.cpu.M482KG.build.extra_flags0=-DCHIP128P -DM482K
#M480.menu.cpu.M482KG.build.board=GENERIC_M482K
#M480.menu.cpu.M482KG.build.ldscript=256K_96K_flash_S.ld
#M480.menu.cpu.M482KG.upload.maximum_size=262144
#M480.menu.cpu.M482KG.upload.maximum_data_size=98304

M480.menu.cpu.M482SI=GENERIC_M482SI(LQP64)(512kFLASH 160kRAM)
M480.menu.cpu.M482SI.build.extra_flags0=-DCHIP64P -DM482S
M480.menu.cpu.M482SI.build.board=GENERIC_M482S
M480.menu.cpu.M482SI.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.M482SI.upload.maximum_size=524288
M480.menu.cpu.M482SI.upload.maximum_data_size=163840

#M480.menu.cpu.M482SG=GENERIC_M482SG(LQP64)(256kFLASH 96kRAM)
#M480.menu.cpu.M482SG.build.extra_flags0=-DCHIP64P -DM482S
#M480.menu.cpu.M482SG.build.board=GENERIC_M482S
#M480.menu.cpu.M482SG.build.ldscript=256K_96K_flash_S.ld
#M480.menu.cpu.M482SG.upload.maximum_size=262144
#M480.menu.cpu.M482SG.upload.maximum_data_size=98304

M480.menu.cpu.M482LI=GENERIC_M482LI(LQP48)(512kFLASH 160kRAM)
M480.menu.cpu.M482LI.build.extra_flags0=-DCHIP48P -DM482L
M480.menu.cpu.M482LI.build.board=GENERIC_M482L
M480.menu.cpu.M482LI.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.M482LI.upload.maximum_size=524288
M480.menu.cpu.M482LI.upload.maximum_data_size=163840

#M480.menu.cpu.M482LG=GENERIC_M482LG(LQP48)(256kFLASH 96kRAM)
#M480.menu.cpu.M482LG.build.extra_flags0=-DCHIP48P -DM482L
#M480.menu.cpu.M482LG.build.board=GENERIC_M482L
#M480.menu.cpu.M482LG.build.ldscript=256K_96K_flash_S.ld
#M480.menu.cpu.M482LG.upload.maximum_size=262144
#M480.menu.cpu.M482LG.upload.maximum_data_size=98304

M480.menu.cpu.M482ZI=GENERIC_M482ZI(QFN33)(512kFLASH 160kRAM)
M480.menu.cpu.M482ZI.build.extra_flags0=-DCHIP33P -DM482Z
M480.menu.cpu.M482ZI.build.board=GENERIC_M482Z
M480.menu.cpu.M482ZI.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.M482ZI.upload.maximum_size=524288
M480.menu.cpu.M482ZI.upload.maximum_data_size=163840

M480.menu.cpu.M483K=GENERIC_M483K(LQP128)(512kFLASH 160kRAM)
M480.menu.cpu.M483K.build.extra_flags0=-DCHIP128P -DM483K
M480.menu.cpu.M483K.build.board=GENERIC_M483K
M480.menu.cpu.M483K.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.M483K.upload.maximum_size=524288
M480.menu.cpu.M483K.upload.maximum_data_size=163840

M480.menu.cpu.M483SI=GENERIC_M483SI(LQP64)(512kFLASH 160kRAM)
M480.menu.cpu.M483SI.build.extra_flags0=-DCHIP64P -DM483S
M480.menu.cpu.M483SI.build.board=GENERIC_M483S
M480.menu.cpu.M483SI.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.M483SI.upload.maximum_size=524288
M480.menu.cpu.M483SI.upload.maximum_data_size=163840

#M480.menu.cpu.M483SG=GENERIC_M483SG(LQP64)(256kFLASH 96kRAM)
#M480.menu.cpu.M483SG.build.extra_flags0=-DCHIP64P -DM483S
#M480.menu.cpu.M483SG.build.board=GENERIC_M483S
#M480.menu.cpu.M483SG.build.ldscript=256K_96K_flash_S.ld
#M480.menu.cpu.M483SG.upload.maximum_size=262144
#M480.menu.cpu.M483SG.upload.maximum_data_size=98304

M480.menu.cpu.M484K=GENERIC_M484K(LQP128)(512kFLASH 160kRAM)
M480.menu.cpu.M484K.build.extra_flags0=-DCHIP128P -DM484K
M480.menu.cpu.M484K.build.board=GENERIC_M484K
M480.menu.cpu.M484K.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.M484K.upload.maximum_size=524288
M480.menu.cpu.M484K.upload.maximum_data_size=163840

