huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
M480.menu.cpu.M484SI=GENERIC_M484SI(LQP64)(512kFLASH 160kRAM)
M480.menu.cpu.M484SI.build.extra_flags0=-DCHIP64P -DM484S
M480.menu.cpu.M484SI.build.board=GENERIC_M484S
M480.menu.cpu.M484SI.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.M484SI.upload.maximum_size=524288
M480.menu.cpu.M484SI.upload.maximum_data_size=163840

#M480.menu.cpu.M484SG=GENERIC_M484SG(LQP64)(256kFLASH 96kRAM)
#M480.menu.cpu.M484SG.build.extra_flags0=-DCHIP64P -DM484S
#M480.menu.cpu.M484SG.build.board=GENERIC_M484S
#M480.menu.cpu.M484SG.build.ldscript=256K_96K_flash_S.ld
#M480.menu.cpu.M484SG.upload.maximum_size=262144
#M480.menu.cpu.M484SG.upload.maximum_data_size=98304

M480.menu.startadr.default=flash(512k+160k)
M480.menu.startadr.default.build.extra_flags={build.extra_flags0}

#M480.menu.startadr.R20000000=Sram 0:0x20000000(128K+32K)
#M480.menu.startadr.R20000000.upload.maximum_size=131072
#M480.menu.startadr.R20000000.upload.maximum_data_size=32768
#M480.menu.startadr.R20000000.build.extra_flags={build.extra_flags0} -DVECT_TAB_OFFSET=0x0000 -DVECT_TAB_SRAM
#M480.menu.startadr.R20000000.build.ldscript=512K_160K_flash_Sram.ld
#M480.menu.startadr.R20000000.upload.uploadadr=0x20000000
#M480.menu.startadr.R20000000.upload.vect=0x20000000

#M480.menu.startadr.F00000000=flash(128+ 32k WithRamBoot)
#M480.menu.startadr.F00000000.upload.maximum_size=131072
#M480.menu.startadr.F00000000.upload.maximum_data_size=32768
#M480.menu.startadr.F00000000.build.extra_flags={build.extra_flags0} -DCHK_JUMP_TO_SRAM
#M480.menu.startadr.F00000000.build.ldscript=512K_160K_flash_S00.ld
#M480.menu.startadr.F00000000.upload.uploadadr=0x0000000
#M480.menu.startadr.F00000000.upload.vect=0x00000000

M480.menu.clock_source.HIRC192=HIRC(192MHz)
M480.menu.clock_source.HIRC192.build.f_cpu=192000000L -DHIRC
M480.menu.clock_source.HXT192=HXT_12M(192MMHz)
M480.menu.clock_source.HXT192.build.f_cpu=192000000L -DHXT12

M480.menu.serial.UART0=Serial0(PB_12/13)
M480.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
M480.menu.serial.UART1=Serial1(PA_2/3)
M480.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
M480.menu.serial.UART2=Serial2(PB_0/1)
M480.menu.serial.UART2.build.extra_flags_serial=-DMENU_SERIAL=Serial2
M480.menu.serial.UART3=Serial3(PB_14/15)
M480.menu.serial.UART3.build.extra_flags_serial=-DMENU_SERIAL=Serial3
M480.menu.serial.UART4=Serial4(PA_12/13))
M480.menu.serial.UART4.build.extra_flags_serial=-DMENU_SERIAL=Serial4
M480.menu.serial.UART5=Serial5(PB_4/5)
M480.menu.serial.UART5.build.extra_flags_serial=-DMENU_SERIAL=Serial5
M480.menu.serial.NuICE=Nulink console
M480.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
M480.menu.serial.NuICE.upload.console=NUCONSOLE

#------------------------ DEBUG & LOGLEVEL ----------------------------#
M480.menu.log.default=Release(no-exceptions)
M480.menu.log.default.build.log_level=-fno-exceptions
M480.menu.log.Release=Release(exceptions)
M480.menu.log.fatal=FATAL
M480.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
M480.menu.log.error=ERROR
M480.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
M480.menu.log.warning=WARNING
M480.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
M480.menu.log.info=INFO
M480.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
M480.menu.log.debug=DEBUG
M480.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
M480.menu.log.trace=TRACE
M480.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

M480.upload.tool=nulinkburn
M480.upload.protocol=nuc-ba
M480.upload.use_1200bps_touch=false
M480.upload.wait_for_upload_port=false
M480.upload.native_usb=false

################################################################################################
#                                   Nuvoton-M451                                               #
################################################################################################
M451.name=M451/2/3
M451.build.vid=0x2341
M451.build.pid=0x003e

M451.build.core=nuvoton
M451.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
M451.build.f_cpu=72000000L
M451.build.series=M451Series
M451.build.variant=M451
M451.build.board=NuTiny_M451
M451.build.extra_flags0=-D__M451__ -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON

M451.menu.cpu.m451vg=GENERIC_M451VG6AE(LQP100)(256kFLASH 32kRAM)
M451.menu.cpu.m451vg.build.extra_flags={build.extra_flags0} -DCHIP100P -DM451VG
M451.menu.cpu.m451vg.build.ldscript=256K_32K_flash.ld
M451.menu.cpu.m451vg.upload.maximum_size=262144
M451.menu.cpu.m451vg.upload.maximum_data_size=32768

M451.menu.cpu.m451ve=GENERIC_M451VE6AE(LQP100)(128kFLASH 32kRAM)
M451.menu.cpu.m451ve.build.extra_flags={build.extra_flags0} -DCHIP100P -DM451VE
M451.menu.cpu.m451ve.build.ldscript=128K_32K_flash.ld
M451.menu.cpu.m451ve.upload.maximum_size=131072
M451.menu.cpu.m451ve.upload.maximum_data_size=32768

M451.menu.cpu.m451rg=GENERIC_M451RG6AE(LQP64)(256kFLASH 32kRAM)
M451.menu.cpu.m451rg.build.extra_flags={build.extra_flags0} -DCHIP64P -DM451RG
M451.menu.cpu.m451rg.build.ldscript=256K_32K_flash.ld
M451.menu.cpu.m451rg.upload.maximum_size=262144
M451.menu.cpu.m451rg.upload.maximum_data_size=32768

M451.menu.cpu.m451re=GENERIC_M451RE6AE(LQP64)(128kFLASH 32kRAM)
M451.menu.cpu.m451re.build.extra_flags={build.extra_flags0} -DCHIP64P -DM451RE
M451.menu.cpu.m451re.build.ldscript=128K_32K_flash.ld
M451.menu.cpu.m451re.upload.maximum_size=131072
M451.menu.cpu.m451re.upload.maximum_data_size=32768

M451.menu.cpu.m451lg=GENERIC_M451LG6AE(LQP48)(256kFLASH 32kRAM)
M451.menu.cpu.m451lg.build.extra_flags={build.extra_flags0} -DCHIP48P -DM451LG
M451.menu.cpu.m451lg.build.ldscript=256K_32K_flash.ld
M451.menu.cpu.m451lg.upload.maximum_size=262144
M451.menu.cpu.m451lg.upload.maximum_data_size=32768

M451.menu.cpu.m451le=GENERIC_M451LE6AE(LQP48)(128kFLASH 32kRAM)
M451.menu.cpu.m451le.build.extra_flags={build.extra_flags0} -DCHIP48P -DM451LE
M451.menu.cpu.m451le.build.ldscript=128K_32K_flash.ld
M451.menu.cpu.m451le.upload.maximum_size=131072
M451.menu.cpu.m451le.upload.maximum_data_size=32768

M451.menu.cpu.m452rg=GENERIC_M452RG6AE(LQP64)(256kFLASH 32kRAM)
M451.menu.cpu.m452rg.build.extra_flags={build.extra_flags0} -DCHIP64P -DM452RG
M451.menu.cpu.m452rg.build.ldscript=256K_32K_flash.ld
M451.menu.cpu.m452rg.upload.maximum_size=262144
M451.menu.cpu.m452rg.upload.maximum_data_size=32768

M451.menu.cpu.m452re=GENERIC_M452RE6AE(LQP64)(128kFLASH 32kRAM)
M451.menu.cpu.m452re.build.extra_flags={build.extra_flags0} -DCHIP64P -DM452RE
M451.menu.cpu.m452re.build.ldscript=128K_32K_flash.ld
M451.menu.cpu.m452re.upload.maximum_size=131072
M451.menu.cpu.m452re.upload.maximum_data_size=32768

M451.menu.cpu.m452lg=GENERIC_M452LG6AE(LQP48)(256kFLASH 32kRAM)
M451.menu.cpu.m452lg.build.extra_flags={build.extra_flags0} -DCHIP48P -DM452LG
M451.menu.cpu.m452lg.build.ldscript=256K_32K_flash.ld
M451.menu.cpu.m452lg.upload.maximum_size=262144
M451.menu.cpu.m452lg.upload.maximum_data_size=32768

M451.menu.cpu.m452le=GENERIC_M452LE6AE(LQP48)(128kFLASH 32kRAM)
M451.menu.cpu.m452le.build.extra_flags={build.extra_flags0} -DCHIP48P -DM452LE
M451.menu.cpu.m452le.build.ldscript=128K_32K_flash.ld
M451.menu.cpu.m452le.upload.maximum_size=131072
M451.menu.cpu.m452le.upload.maximum_data_size=32768

