huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NUC131.menu.log.default=Release(no-exceptions)
NUC131.menu.log.default.build.log_level=-fno-exceptions
NUC131.menu.log.Release=Release(exceptions)
NUC131.menu.log.fatal=FATAL
NUC131.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
NUC131.menu.log.error=ERROR
NUC131.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
NUC131.menu.log.warning=WARNING
NUC131.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
NUC131.menu.log.info=INFO
NUC131.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
NUC131.menu.log.debug=DEBUG
NUC131.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
NUC131.menu.log.trace=TRACE
NUC131.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

NUC131.upload.tool=nulinkburn
NUC131.upload.protocol=nuc-ba
NUC131.upload.use_1200bps_touch=false
NUC131.upload.wait_for_upload_port=false
NUC131.upload.native_usb=false

############################################### NuEdu-NANO100 ##########################################
NANO100s.name=NANO100
NANO100s.build.vid=0x2341
NANO100s.build.pid=0x003e

NANO100s.build.core=nuvoton
NANO100s.build.mcu=cortex-m0
NANO100s.build.f_cpu=42000000L
NANO100s.build.variant=Nano120
NANO100s.build.board=NANO120
NANO100s.build.series=Nano100Series

NANO100s.menu.cpu.NuEdu=NuEdu-EVB_NANO130(128kFLASH 16kRAM)
NANO100s.menu.cpu.NuEdu.build.board=NuEdu_NANO130
NANO100s.menu.cpu.NuEdu.build.variant=Nano120
NANO100s.menu.cpu.NuEdu.build.chip=-DCHIP128P -DNANO130
NANO100s.menu.cpu.NuEdu.build.ldscript=128K_16K_flash_S.ld
NANO100s.menu.cpu.NuEdu.upload.maximum_size=131072
NANO100s.menu.cpu.NuEdu.upload.maximum_data_size=16384

NANO100s.menu.cpu.NuTiny=NuTiny_EVB_NANO130(128kFLASH 16kRAM)
NANO100s.menu.cpu.NuTiny.build.board=NuTiny_NANO130
NANO100s.menu.cpu.NuTiny.build.variant=Nano120
NANO100s.menu.cpu.NuTiny.build.chip=-DCHIP128P -DNANO130
NANO100s.menu.cpu.NuTiny.build.ldscript=128K_16K_flash_S.ld
NANO100s.menu.cpu.NuTiny.upload.maximum_size=131072
NANO100s.menu.cpu.NuTiny.upload.maximum_data_size=16384

NANO100s.menu.cpu.nano120ke3=NuTiny_NANO120KE3(LQP128)(128kFLASH 16kRAM)
NANO100s.menu.cpu.nano120ke3.build.chip=-DCHIP128P -DNANO120KE3 -DNuTiny_EVB
NANO100s.menu.cpu.nano120ke3.build.ldscript=128K_16K_flash_S.ld
NANO100s.menu.cpu.nano120ke3.upload.maximum_size=125952
NANO100s.menu.cpu.nano120ke3.upload.maximum_data_size=16384
NANO100s.menu.cpu.nano120ke3.upload.device=NANO120KE3BN

NANO100s.menu.cpu.nano120kd3=GENERIC_NANO120KD3(LQP128)(64kFLASH 16kRAM)
NANO100s.menu.cpu.nano120kd3.build.chip=-DCHIP128P -DNANO120KD3
NANO100s.menu.cpu.nano120kd3.build.ldscript=64K_16K_flash_S.ld
NANO100s.menu.cpu.nano120kd3.upload.maximum_size=65536
NANO100s.menu.cpu.nano120kd3.upload.maximum_data_size=16384
NANO100s.menu.cpu.nano120kd3.upload.device=NANO120KD3BN

NANO100s.menu.cpu.nano120kd2=GENERIC_NANO120KD2(LQP128)(64kFLASH 8kRAM)
NANO100s.menu.cpu.nano120kd2.build.chip=-DCHIP128P -DNANO120KD2
NANO100s.menu.cpu.nano120kd2.build.ldscript=64K_8K_flash_S.ld
NANO100s.menu.cpu.nano120kd2.upload.maximum_size=65536
NANO100s.menu.cpu.nano120kd2.upload.maximum_data_size=8192
NANO100s.menu.cpu.nano120kd2.upload.device=NANO120KD2BN

NANO100s.menu.cpu.nano120se3=GENERIC_NANO120SE3(LQP64)128kFLASH 16kRAM)
NANO100s.menu.cpu.nano120se3.build.chip=-DCHIP64P -DNANO120SE3
NANO100s.menu.cpu.nano120se3.build.ldscript=128K_16K_flash_S.ld
NANO100s.menu.cpu.nano120se3.upload.maximum_size=125952
NANO100s.menu.cpu.nano120se3.upload.maximum_data_size=16384
NANO100s.menu.cpu.nano120se3.upload.device=NANO120SE3BN

NANO100s.menu.cpu.nano120sd3=GENERIC_NANO120SD3(LQP64)(64kFLASH 16kRAM)
NANO100s.menu.cpu.nano120sd3.build.chip=-DCHIP64P -DNANO120SD3
NANO100s.menu.cpu.nano120sd3.build.ldscript=64K_16K_flash_S.ld
NANO100s.menu.cpu.nano120sd3.upload.maximum_size=65536
NANO100s.menu.cpu.nano120sd3.upload.maximum_data_size=16384
NANO100s.menu.cpu.nano120sd3.upload.device=NANO120SD3BN

NANO100s.menu.cpu.nano120sd2=GENERIC_NANO120SD2(LQP64)(64kFLASH 8kRAM)
NANO100s.menu.cpu.nano120sd2.build.chip=-DCHIP64P -DNANO120SD2
NANO100s.menu.cpu.nano120sd2.build.ldscript=64K_8K_flash_S.ld
NANO100s.menu.cpu.nano120sd2.upload.maximum_size=65536
NANO100s.menu.cpu.nano120sd2.upload.maximum_data_size=8192 
NANO100s.menu.cpu.nano120sd2.upload.device=NANO120SD2BN

NANO100s.menu.cpu.nano120sc2=GENERIC_NANO120SC2(LQP64)(64kFLASH 8kRAM)
NANO100s.menu.cpu.nano120sc2.build.chip=-DCHIP64P -DNANO120SC2
NANO100s.menu.cpu.nano120sc2.build.ldscript=32K_8K_flash_S.ld
NANO100s.menu.cpu.nano120sc2.upload.maximum_size=32768
NANO100s.menu.cpu.nano120sc2.upload.maximum_data_size=8192
NANO100s.menu.cpu.nano120sc2.upload.device=NANO120SC2BN

NANO100s.menu.cpu.nano120le3=GENERIC_NANO120LE3(LQP48)128kFLASH 16kRAM)
NANO100s.menu.cpu.nano120le3.build.chip=-DCHIP48P -DNANO120LE3
NANO100s.menu.cpu.nano120le3.build.ldscript=128K_16K_flash_S.ld
NANO100s.menu.cpu.nano120le3.upload.maximum_size=125952
NANO100s.menu.cpu.nano120le3.upload.maximum_data_size=16384
NANO100s.menu.cpu.nano120le3.upload.device=NANO120LE3BN

NANO100s.menu.cpu.nano120ld3=GENERIC_NANO120LD3(LQP48)(64kFLASH 16kRAM)
NANO100s.menu.cpu.nano120ld3.build.chip=-DCHIP48P -DNANO120LD3
NANO100s.menu.cpu.nano120ld3.build.ldscript=64K_16K_flash_S.ld
NANO100s.menu.cpu.nano120ld3.upload.maximum_size=65536
NANO100s.menu.cpu.nano120ld3.upload.maximum_data_size=16384
NANO100s.menu.cpu.nano120ld3.upload.device=NANO120LD3BN

NANO100s.menu.cpu.nano120ld2=GENERIC_NANO120LD2(LQP48)(64kFLASH 8kRAM)
NANO100s.menu.cpu.nano120ld2.build.chip=-DCHIP48P -DNANO120LD2
NANO100s.menu.cpu.nano120ld2.build.ldscript=64K_8K_flash_S.ld
NANO100s.menu.cpu.nano120ld2.upload.maximum_size=65536
NANO100s.menu.cpu.nano120ld2.upload.maximum_data_size=8192
NANO100s.menu.cpu.nano120ld2.upload.device=NANO120LD2BN

NANO100s.menu.cpu.nano120lc2=GENERIC_NANO120LC2(LQP48)(64kFLASH 8kRAM)
NANO100s.menu.cpu.nano120lc2.build.chip=-DCHIP48P -DNANO120LC2
NANO100s.menu.cpu.nano120lc2.build.ldscript=32K_8K_flash_S.ld
NANO100s.menu.cpu.nano120lc2.upload.maximum_size=32768
NANO100s.menu.cpu.nano120lc2.upload.maximum_data_size=8192
NANO100s.menu.cpu.nano120lc2.upload.device=NANO120LC2BN

NANO100s.build.extra_flags=-D__NANO100__ -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON {build.chip}

NANO100s.menu.clock_source.HXT12=HXT
NANO100s.menu.clock_source.HXT12.build.osc=HXT12
NANO100s.menu.clock_source.HIRC=HIRC
NANO100s.menu.clock_source.HIRC.build.osc=HIRC

NANO100s.menu.cpu_speed.f48=42M
NANO100s.menu.cpu_speed.f48.build.f_cpu=42000000L -D{build.osc}
NANO100s.menu.cpu_speed.f32=28M
NANO100s.menu.cpu_speed.f32.build.f_cpu=28000000L -D{build.osc}
NANO100s.menu.cpu_speed.f24=21M
NANO100s.menu.cpu_speed.f24.build.f_cpu=21000000L -D{build.osc}

NANO100s.menu.serial.UART0=Serial0(PA_14/15)
NANO100s.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NANO100s.menu.serial.UART1=Serial1(PB_4/5)
NANO100s.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
NANO100s.menu.serial.NuICE=Nulink console
NANO100s.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
NANO100s.menu.serial.NuICE.upload.console=NUCONSOLE

