huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NANO100s.menu.log.default=Release(no-exceptions)
NANO100s.menu.log.default.build.log_level=-fno-exceptions
NANO100s.menu.log.Release=Release(exceptions)
NANO100s.menu.log.fatal=FATAL
NANO100s.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
NANO100s.menu.log.error=ERROR
NANO100s.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
NANO100s.menu.log.warning=WARNING
NANO100s.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
NANO100s.menu.log.info=INFO
NANO100s.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
NANO100s.menu.log.debug=DEBUG
NANO100s.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
NANO100s.menu.log.trace=TRACE
NANO100s.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

NANO100s.menu.upload_method.nulink=Nulink
NANO100s.menu.upload_method.nulink.upload.tool=nulinkburn
NANO100s.menu.upload_method.nulink.upload.protocol=nuc-ba
NANO100s.menu.upload_method.nulink.upload.use_1200bps_touch=false
NANO100s.menu.upload_method.nulink.upload.wait_for_upload_port=false
NANO100s.menu.upload_method.nulink.upload.native_usb=false

NANO100s.menu.upload_method.jLinkMethod=JLink
NANO100s.menu.upload_method.jLinkMethod.upload.tool=jlinkob_upload
NANO100s.menu.upload_method.jLinkMethod.upload.protocol=jlink

############################################### NuMaker-TRIO ##########################################
NANO1x2.name=NANO1X2
NANO1x2.build.vid=0x2341
NANO1x2.build.pid=0x003e

NANO1x2.build.core=nuvoton
NANO1x2.build.mcu=cortex-m0
NANO1x2.build.f_cpu=32000000L
NANO1x2.build.variant=NANO102ZC2_TRIO
NANO1x2.build.board=NANO102
NANO1x2.build.series=Nano1X2Series

NANO1x2.menu.cpu.numake_trio=NuMaker_TRIO(NANO102ZC2 32kFLASH 8kRAM)
NANO1x2.menu.cpu.numake_trio.build.extra_flags=-D__NANO1X2__ -D__NANO102ZC2AN__ -D__IOT_EVB__ -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON
NANO1x2.menu.cpu.numake_trio.build.ldscript=32K_8K_flash.ld
NANO1x2.menu.cpu.numake_trio.upload.maximum_size=32768
NANO1x2.menu.cpu.numake_trio.upload.maximum_data_size=8192

NANO1x2.menu.serial.UART0=Serial0
NANO1x2.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NANO1x2.menu.serial.UART1=Serial1
NANO1x2.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
NANO1x2.menu.serial.NuICE=Nulink console
NANO1x2.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
NANO1x2.menu.serial.NuICE.upload.console=NUCONSOLE

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NANO1x2.menu.log.default=Release(no-exceptions)
NANO1x2.menu.log.default.build.log_level=-fno-exceptions
NANO1x2.menu.log.Release=Release(exceptions)
NANO1x2.menu.log.fatal=FATAL
NANO1x2.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
NANO1x2.menu.log.error=ERROR
NANO1x2.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
NANO1x2.menu.log.warning=WARNING
NANO1x2.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
NANO1x2.menu.log.info=INFO
NANO1x2.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
NANO1x2.menu.log.debug=DEBUG
NANO1x2.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
NANO1x2.menu.log.trace=TRACE
NANO1x2.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

NANO1x2.upload.use_1200bps_touch=false
NANO1x2.upload.wait_for_upload_port=false
NANO1x2.upload.tool=nulinkburn
NANO1x2.upload.protocol=nuc-ba
NANO1x2.upload.native_usb=false

########################################################
#                  nuvoton m05x                       #
########################################################
M05x.name=M052/4/8/16

M05x.build.core=nuvoton
M05x.build.mcu=cortex-m0
M05x.build.f_cpu=22118400L
M05x.build.variant=M0516
M05x.build.board=M0516

M05x.menu.cpu.M0516L_51dip=M0516_51DP(LQP48)(64kFLASH 4kRAM)
M05x.menu.cpu.M0516L_51dip.build.extra_flags=-DCHIP48P -DM0516L
M05x.menu.cpu.M0516L_51dip.build.series=M051Series
M05x.menu.cpu.M0516L_51dip.build.variant=M051
M05x.menu.cpu.M0516L_51dip.build.board=M0516L
M05x.menu.cpu.M0516L_51dip.build.ldscript=64K_4K_flash.ld
M05x.menu.cpu.M0516L_51dip.upload.maximum_size=65536
M05x.menu.cpu.M0516L_51dip.upload.maximum_data_size=4096
M05x.menu.cpu.M0516L_51dip.upload.device=M0516LE

M05x.menu.cpu.M0516L=GENERIC_M0516L(LQP48)(64kFLASH 4kRAM)
M05x.menu.cpu.M0516L.build.extra_flags=-DCHIP48P -DM0516L
M05x.menu.cpu.M0516L.build.series=M051Series
M05x.menu.cpu.M0516L.build.variant=M051
M05x.menu.cpu.M0516L.build.board=M0516L
M05x.menu.cpu.M0516L.build.ldscript=64K_4K_flash.ld
M05x.menu.cpu.M0516L.upload.maximum_size=65536
M05x.menu.cpu.M0516L.upload.maximum_data_size=4096
M05x.menu.cpu.M0516L.upload.device=M0516LE

M05x.menu.cpu.M0516Z=GENERIC_M0516Z(QFN33) (64kFLASH 4kRAM)
M05x.menu.cpu.M0516Z.build.extra_flags=-DCHIP33P -DM0516Z
M05x.menu.cpu.M0516Z.build.series=M051Series
M05x.menu.cpu.M0516Z.build.variant=M051
M05x.menu.cpu.M0516Z.build.board=GENERIC_M0516Z
M05x.menu.cpu.M0516Z.build.ldscript=64K_4K_flash.ld
M05x.menu.cpu.M0516Z.upload.maximum_size=65536
M05x.menu.cpu.M0516Z.upload.maximum_data_size=4096
M05x.menu.cpu.M0516Z.upload.device=M0516ZE

M05x.menu.cpu.M058L=GENERIC_M058L(LQP48)  (32kFLASH 4kRAM)
M05x.menu.cpu.M058L.build.extra_flags=-DCHIP48P -DM058L
M05x.menu.cpu.M058L.build.series=M058S
M05x.menu.cpu.M058L.build.variant=M058S
M05x.menu.cpu.M058L.build.board=GENERIC_M058L
M05x.menu.cpu.M058L.build.ldscript=32K_4K_flash.ld
M05x.menu.cpu.M058L.upload.maximum_size=32768
M05x.menu.cpu.M058L.upload.maximum_data_size=4096
M05x.menu.cpu.M058L.upload.device=M058LE

M05x.menu.cpu.M058Z=GENERIC_M058Z(QFN33)  (32kFLASH 4kRAM)
M05x.menu.cpu.M058Z.build.extra_flags=-DCHIP33P -DM058Z
M05x.menu.cpu.M058Z.build.series=M058S
M05x.menu.cpu.M058Z.build.variant=M058S
M05x.menu.cpu.M058Z.build.board=GENERIC_M058Z
M05x.menu.cpu.M058Z.build.ldscript=32K_4K_flash.ld
M05x.menu.cpu.M058Z.upload.maximum_size=32768
M05x.menu.cpu.M058Z.upload.maximum_data_size=4096
M05x.menu.cpu.M058Z.upload.device=M058ZE

M05x.menu.cpu.M058S=GENERIC_M058S(TSSOP20)(32kFLASH 4kRAM)
M05x.menu.cpu.M058S.build.extra_flags=-DCHIP20P -DM058s
M05x.menu.cpu.M058S.build.series=M058S
M05x.menu.cpu.M058S.build.variant=M058S
M05x.menu.cpu.M058S.build.board=GENERIC_M058S
M05x.menu.cpu.M058S.build.ldscript=32K_4K_flash.ld
M05x.menu.cpu.M058S.upload.maximum_size=32768
M05x.menu.cpu.M058S.upload.maximum_data_size=4096
M05x.menu.cpu.M058S.upload.device=M058SE

