huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
M05x.menu.cpu.M054L=GENERIC_M054L(LQP48)  (16kFLASH 4kRAM)
M05x.menu.cpu.M054L.build.extra_flags=-DCHIP48P -DM054L
M05x.menu.cpu.M054L.build.series=M051Series
M05x.menu.cpu.M054L.build.variant=M051
M05x.menu.cpu.M054L.build.board=GENERIC_M054L
M05x.menu.cpu.M054L.build.ldscript=16K_4K_flash.ld
M05x.menu.cpu.M054L.upload.maximum_size=16384
M05x.menu.cpu.M054L.upload.maximum_data_size=4096
M05x.menu.cpu.M054L.upload.device=M054LE

M05x.menu.cpu.M054Z=GENERIC_M054Z(QFN33)  (16kFLASH 4kRAM)
M05x.menu.cpu.M054Z.build.extra_flags=-DCHIP33P -DM054Z
M05x.menu.cpu.M054Z.build.series=M051Series
M05x.menu.cpu.M054Z.build.variant=M051
M05x.menu.cpu.M054Z.build.board=GENERIC_M054Z
M05x.menu.cpu.M054Z.build.ldscript=16K_4K_flash.ld
M05x.menu.cpu.M054Z.upload.maximum_size=16384
M05x.menu.cpu.M054Z.upload.maximum_data_size=4096
M05x.menu.cpu.M054Z.upload.device=M054ZE

M05x.menu.cpu.M052L=GENERIC_M052L(LQP48)   (8kFLASH 4kRAM)
M05x.menu.cpu.M052L.build.extra_flags=-DCHIP48P -DM052L
M05x.menu.cpu.M052L.build.series=M051Series
M05x.menu.cpu.M052L.build.variant=M051
M05x.menu.cpu.M052L.build.board=GENERIC_M052L
M05x.menu.cpu.M052L.build.ldscript=8K_4K_flash.ld
M05x.menu.cpu.M052L.upload.maximum_size=8192
M05x.menu.cpu.M052L.upload.maximum_data_size=4096
M05x.menu.cpu.M052L.upload.device=M052LE

M05x.menu.cpu.M052Z=GENERIC_M052Z(QFN33)   (8kFLASH 4kRAM)
M05x.menu.cpu.M052Z.build.extra_flags=-DCHIP33P -DM052Z
M05x.menu.cpu.M052Z.build.series=M051Series
M05x.menu.cpu.M052Z.build.variant=M051
M05x.menu.cpu.M052Z.build.board=GENERIC_M052Z
M05x.menu.cpu.M052Z.build.ldscript=8K_4K_flash.ld
M05x.menu.cpu.M052Z.upload.maximum_size=8192
M05x.menu.cpu.M052Z.upload.maximum_data_size=4096
M05x.menu.cpu.M052Z.upload.device=M052ZE

M05x.menu.clock_source.HIRC=HIRC_22M(22.1184MHz)
M05x.menu.clock_source.HIRC.build.f_cpu=22118400L -DHIRC
M05x.menu.clock_source.HXT1=HXT_12M(48MMHz)
M05x.menu.clock_source.HXT1.build.f_cpu=48000000L -DHXT12
M05x.menu.clock_source.HXT2=HXT_12M(24MMHz)
M05x.menu.clock_source.HXT2.build.f_cpu=24000000L -DHXT12

M05x.menu.serial.UART0=Serial0(P3_0/1)
M05x.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
M05x.menu.serial.UART1=Serial1(P0_3/2)
M05x.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
M05x.menu.serial.NuICE=Nulink console
M05x.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
M05x.menu.serial.NuICE.upload.console=NUCONSOLE

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
M05x.menu.log.default=Release(no-exceptions)
M05x.menu.log.default.build.log_level=-fno-exceptions
M05x.menu.log.Release=Release(exceptions)
M05x.menu.log.fatal=FATAL
M05x.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
M05x.menu.log.error=ERROR
M05x.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
M05x.menu.log.warning=WARNING
M05x.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
M05x.menu.log.info=INFO
M05x.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
M05x.menu.log.debug=DEBUG
M05x.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
M05x.menu.log.trace=TRACE
M05x.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

M05x.menu.upload_method.nulink=Nulink
M05x.menu.upload_method.nulink.upload.tool=nulinkburn
M05x.menu.upload_method.nulink.upload.protocol=nuc-ba
M05x.menu.upload_method.nulink.upload.use_1200bps_touch=false
M05x.menu.upload_method.nulink.upload.wait_for_upload_port=false
M05x.menu.upload_method.nulink.upload.native_usb=false

M05x.menu.upload_method.jLinkMethod=JLink
M05x.menu.upload_method.jLinkMethod.upload.tool=jlinkob_upload
M05x.menu.upload_method.jLinkMethod.upload.protocol=jlink

########################################################
#                  nuvoton M031                       #
########################################################
M031.name=NuMaker_M031/2
M031.vid.0=0x0416
M031.pid.0=0x5200

M031.build.core=nuvoton
M031.build.mcu=cortex-m0
M031.build.f_cpu=48000000L
M031.build.series=M031Series
M031.build.variant=M031
M031.build.board=M031

M031.menu.cpu.M032SE=NuMaker_M032SE(128kFLASH 16kRAM)
M031.menu.cpu.M032SE.build.extra_flags=-DCHIP64P -DM032SE
M031.menu.cpu.M032SE.build.board=NuMaker_M032SE
M031.menu.cpu.M032SE.build.ldscript=128K_16K_flash_S.ld
M031.menu.cpu.M032SE.upload.maximum_size=131072
M031.menu.cpu.M032SE.upload.maximum_data_size=16384
M031.menu.cpu.M032SE.upload.device=M032SE

M031.menu.cpu.M031SD=NuMaker_M031SD(64kFLASH 8kRAM)
M031.menu.cpu.M031SD.build.extra_flags=-DCHIP64P -DM031SD
M031.menu.cpu.M031SD.build.board=M031SD
M031.menu.cpu.M031SD.build.ldscript=64K_8K_flash_S.ld
M031.menu.cpu.M031SD.upload.maximum_size=65536
M031.menu.cpu.M031SD.upload.maximum_data_size=8192
M031.menu.cpu.M031SD.upload.device=M031SD

M031.menu.cpu.M031TC=NuMaker_M031TC(32kFLASH 4kRAM)
M031.menu.cpu.M031TC.build.extra_flags=-DCHIP33P -DM031TC
M031.menu.cpu.M031TC.build.board=NuMakerM031TC
M031.menu.cpu.M031TC.build.ldscript=32K_4K_flash_S.ld
M031.menu.cpu.M031TC.upload.maximum_size=32768
M031.menu.cpu.M031TC.upload.maximum_data_size=4096
M031.menu.cpu.M031TC.upload.device=M031TC

M031.menu.cpu.M031TB=NuMaker_M031TB(16kFLASH 2kRAM)
M031.menu.cpu.M031TB.build.extra_flags=-DCHIP33P -DM031TB
M031.menu.cpu.M031TB.build.board=NuMakerM031TB
M031.menu.cpu.M031TB.build.ldscript=16K_2K_flash_S.ld
M031.menu.cpu.M031TB.upload.maximum_size=16384
M031.menu.cpu.M031TB.upload.maximum_data_size=2048
M031.menu.cpu.M031TB.upload.device=M031TB

M031.menu.clock_source.HIRC=HIRC_48M(72MHz)
M031.menu.clock_source.HIRC.build.f_cpu=72000000L -DHIRC
M031.menu.clock_source.HXT1=HXT_32M(72MMHz)
M031.menu.clock_source.HXT1.build.f_cpu=72000000L -DHXT32

M031.menu.serial.UART0=Serial0(PB_12/13)
M031.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
M031.menu.serial.UART1=Serial1(PB_2/3)
M031.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
M031.menu.serial.UART2=Serial2(PB_0/1)
M031.menu.serial.UART2.build.extra_flags_serial=-DMENU_SERIAL=Serial1
M031.menu.serial.NuICE=Nulink console
M031.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
M031.menu.serial.NuICE.upload.console=NUCONSOLE

