huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
M031.menu.log.default=Release(no-exceptions)
M031.menu.log.default.build.log_level=-fno-exceptions
M031.menu.log.Release=Release(exceptions)
M031.menu.log.fatal=FATAL
M031.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
M031.menu.log.error=ERROR
M031.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
M031.menu.log.warning=WARNING
M031.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
M031.menu.log.info=INFO
M031.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
M031.menu.log.debug=DEBUG
M031.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
M031.menu.log.trace=TRACE
M031.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

M031.menu.upload_method.nulink=Nulink
M031.menu.upload_method.nulink.upload.tool=nulinkburn
M031.menu.upload_method.nulink.upload.protocol=nuc-ba
M031.menu.upload_method.nulink.upload.use_1200bps_touch=false
M031.menu.upload_method.nulink.upload.wait_for_upload_port=false
M031.menu.upload_method.nulink.upload.native_usb=false

M031.menu.upload_method.jLinkMethod=JLink
M031.menu.upload_method.jLinkMethod.upload.tool=jlinkob_upload
M031.menu.upload_method.jLinkMethod.upload.protocol=jlink

########################################################
#                  nuvoton mini58                      #
########################################################
MINI58.name=Mini58

MINI58.build.core=nuvoton
MINI58.build.mcu=cortex-m0
MINI58.build.f_cpu=22118400L
MINI58.build.series=Mini58Series
MINI58.build.variant=MINI58
MINI58.build.board=GENERIC_MINI58FDE

MINI58.menu.cpu.MINI58L=GENERIC_MINI58L(LQP48)  (32kFLASH 4kRAM)
MINI58.menu.cpu.MINI58L.build.extra_flags=-DCHIP48P -DMINI58L
MINI58.menu.cpu.MINI58L.build.board=GENERIC_MINI58L
MINI58.menu.cpu.MINI58L.build.ldscript=32K_4K_flash.ld
MINI58.menu.cpu.MINI58L.upload.maximum_size=32768
MINI58.menu.cpu.MINI58L.upload.maximum_data_size=4096
MINI58.menu.cpu.MINI58L.upload.device=MINI58LAN

MINI58.menu.cpu.MINI58T=GENERIC_MINI58T/Z(QFN33)(32kFLASH 4kRAM)
MINI58.menu.cpu.MINI58T.build.extra_flags=-DCHIP33P -DMINI58TZ
MINI58.menu.cpu.MINI58T.build.board=GENERIC_MINI58TZ
MINI58.menu.cpu.MINI58T.build.ldscript=32K_4K_flash.ld
MINI58.menu.cpu.MINI58T.upload.maximum_size=32768
MINI58.menu.cpu.MINI58T.upload.maximum_data_size=4096
MINI58.menu.cpu.MINI58T.upload.device=MINI58TAN

MINI58.menu.cpu.MINI58F=GENERIC_MINI58F(TSSOP20)(32kFLASH 4kRAM)
MINI58.menu.cpu.MINI58F.build.extra_flags=-DCHIP20P -DMINI58F
MINI58.menu.cpu.MINI58F.build.board=GENERIC_MINI58F
MINI58.menu.cpu.MINI58F.build.ldscript=32K_4K_flash.ld
MINI58.menu.cpu.MINI58F.upload.maximum_size=32768
MINI58.menu.cpu.MINI58F.upload.maximum_data_size=4096
MINI58.menu.cpu.MINI58F.upload.device=MINI58FAN

MINI58.menu.clock_source.HIRC=HIRC_22M(22.1184MHz)
MINI58.menu.clock_source.HIRC.build.f_cpu=22118400L -DHIRC
MINI58.menu.clock_source.HXT125=HXT_12M(50MMHz)
MINI58.menu.clock_source.HXT125.build.f_cpu=50000000L -DHXT12
#MINI58.menu.clock_source.HXT1210=HXT_12M(100MMHz)
#MINI58.menu.clock_source.HXT1210.build.f_cpu=100000000L -DHXT12

MINI58.menu.serial.UART0=Serial0(P1_2/3)
MINI58.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
MINI58.menu.serial.UART1=Serial1(P1_4/5)
MINI58.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
MINI58.menu.serial.NuICE=Nulink console
MINI58.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
MINI58.menu.serial.NuICE.upload.console=NUCONSOLE

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
MINI58.menu.log.default=Release(no-exceptions)
MINI58.menu.log.default.build.log_level=-fno-exceptions
MINI58.menu.log.Release=Release(exceptions)
MINI58.menu.log.fatal=FATAL
MINI58.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
MINI58.menu.log.error=ERROR
MINI58.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
MINI58.menu.log.warning=WARNING
MINI58.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
MINI58.menu.log.info=INFO
MINI58.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
MINI58.menu.log.debug=DEBUG
MINI58.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
MINI58.menu.log.trace=TRACE
MINI58.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

MINI58.menu.upload_method.nulink=Nulink
MINI58.menu.upload_method.nulink.upload.tool=nulinkburn
MINI58.menu.upload_method.nulink.upload.protocol=nuc-ba
MINI58.menu.upload_method.nulink.upload.use_1200bps_touch=false
MINI58.menu.upload_method.nulink.upload.wait_for_upload_port=false
MINI58.menu.upload_method.nulink.upload.native_usb=false

MINI58.menu.upload_method.jLinkMethod=JLink
MINI58.menu.upload_method.jLinkMethod.upload.tool=jlinkob_upload
MINI58.menu.upload_method.jLinkMethod.upload.protocol=jlink

########################################################
#                  nuvoton mini5X                      #
########################################################
MINI5x.name=Mini54/2

MINI5x.build.core=nuvoton
MINI5x.build.mcu=cortex-m0
MINI5x.build.f_cpu=22118400L
MINI5x.build.series=Mini51Series
MINI5x.build.variant=MINI51
MINI5x.build.board=GENERIC_MINI58FDE

MINI5x.menu.cpu.MINI54L=GENERIC_MINI54L(LQP48)  (16kFLASH 4kRAM)
MINI5x.menu.cpu.MINI54L.build.extra_flags=-DCHIP48P -DMINI54L
MINI5x.menu.cpu.MINI54L.build.board=GENERIC_MINI54L
MINI5x.menu.cpu.MINI54L.build.ldscript=16K_4K_flash.ld
MINI5x.menu.cpu.MINI54L.upload.maximum_size=16384
MINI5x.menu.cpu.MINI54L.upload.maximum_data_size=4096
MINI5x.menu.cpu.MINI54L.upload.device=MINI54LAN

MINI5x.menu.cpu.MINI54T=GENERIC_MINI54T/Z(QEN33)(16kFLASH 4kRAM)
MINI5x.menu.cpu.MINI54T.build.extra_flags=-DCHIP33P -DMINI54TZ
MINI5x.menu.cpu.MINI54T.build.board=GENERIC_MINI54TZ
MINI5x.menu.cpu.MINI54T.build.ldscript=16K_4K_flash.ld
MINI5x.menu.cpu.MINI54T.upload.maximum_size=16384
MINI5x.menu.cpu.MINI54T.upload.maximum_data_size=4096
MINI5x.menu.cpu.MINI54T.upload.device=MINI54TAN

MINI5x.menu.cpu.MINI54F=GENERIC_MINI54F(TSSOP20)(16kFLASH 4kRAM)
MINI5x.menu.cpu.MINI54F.build.extra_flags=-DCHIP20P -DMINI54F
MINI5x.menu.cpu.MINI54F.build.board=GENERIC_MINI54F
MINI5x.menu.cpu.MINI54F.build.ldscript=16K_4K_flash.ld
MINI5x.menu.cpu.MINI54F.upload.maximum_size=16384
MINI5x.menu.cpu.MINI54F.upload.maximum_data_size=4096
MINI5x.menu.cpu.MINI54F.upload.device=MINI54FAN

#MINI5x.menu.cpu.MINI52L=GENERIC_MINI52L(LQP48)   (8kFLASH 2kRAM)
#MINI5x.menu.cpu.MINI52L.build.extra_flags=-DCHIP48P -DMINI52L
#MINI5x.menu.cpu.MINI52L.build.board=GENERIC_MINI52L
#MINI5x.menu.cpu.MINI52L.build.ldscript=8K_2K_flash.ld
#MINI5x.menu.cpu.MINI52L.upload.maximum_size=8192
#MINI5x.menu.cpu.MINI52L.upload.maximum_data_size=2048

#MINI5x.menu.cpu.MINI52T=GENERIC_MINI52T/Z(QEN33) (8kFLASH 2kRAM)
#MINI5x.menu.cpu.MINI52T.build.extra_flags=-DCHIP33P -DMINI52TZ
#MINI5x.menu.cpu.MINI52T.build.board=GENERIC_MINI52TZ
#MINI5x.menu.cpu.MINI52T.build.ldscript=8K_2K_flash.ld
#MINI5x.menu.cpu.MINI52T.upload.maximum_size=8192
#MINI5x.menu.cpu.MINI52T.upload.maximum_data_size=2048

