huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
#MINI5x.menu.cpu.MINI52F=GENERIC_MINI52F(TSSOP20) (8kFLASH 2kRAM)
#MINI5x.menu.cpu.MINI52F.build.extra_flags=-DCHIP20P -DMINI52F
#MINI5x.menu.cpu.MINI52F.build.board=GENERIC_MINI52F
#MINI5x.menu.cpu.MINI52F.build.ldscript=8K_2K_flash.ld
#MINI5x.menu.cpu.MINI52F.upload.maximum_size=8192
#MINI5x.menu.cpu.MINI52F.upload.maximum_data_size=2048

MINI5x.menu.clock_source.HIRC=HIRC_22M(22.1184MHz)
MINI5x.menu.clock_source.HIRC.build.f_cpu=22118400L -DHIRC
MINI5x.menu.clock_source.HXT125=HXT_12M(50MMHz)
MINI5x.menu.clock_source.HXT125.build.f_cpu=50000000L -DHXT12

MINI5x.menu.serial.UART0=Serial0(P1_2/3)
MINI5x.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
MINI5x.menu.serial.NuICE=Nulink console
MINI5x.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
MINI5x.menu.serial.NuICE.upload.console=NUCONSOLE

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
MINI5x.menu.log.default=Release(no-exceptions)
MINI5x.menu.log.default.build.log_level=-fno-exceptions
MINI5x.menu.log.Release=Release(exceptions)
MINI5x.menu.log.fatal=FATAL
MINI5x.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
MINI5x.menu.log.error=ERROR
MINI5x.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
MINI5x.menu.log.warning=WARNING
MINI5x.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
MINI5x.menu.log.info=INFO
MINI5x.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
MINI5x.menu.log.debug=DEBUG
MINI5x.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
MINI5x.menu.log.trace=TRACE
MINI5x.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

MINI5x.menu.upload_method.nulink=Nulink
MINI5x.menu.upload_method.nulink.upload.tool=nulinkburn
MINI5x.menu.upload_method.nulink.upload.protocol=nuc-ba
MINI5x.menu.upload_method.nulink.upload.use_1200bps_touch=false
MINI5x.menu.upload_method.nulink.upload.wait_for_upload_port=false
MINI5x.menu.upload_method.nulink.upload.native_usb=false

MINI5x.menu.upload_method.jLinkMethod=JLink
MINI5x.menu.upload_method.jLinkMethod.upload.tool=jlinkob_upload
MINI5x.menu.upload_method.jLinkMethod.upload.protocol=jlink

########################################################
#                      NUC029F                         #
########################################################
NUC029FAE.name=NUC029FAE

NUC029FAE.build.core=nuvoton
NUC029FAE.build.mcu=cortex-m0
NUC029FAE.build.f_cpu=72000000L
NUC029FAE.build.series=NUC029FAE
NUC029FAE.build.variant=NUC029FAE
NUC029FAE.build.board=GENERIC_NUC029

NUC029FAE.menu.cpu.FAE=GENERIC_NUC029FAE(TSSOP20)(16kFLASH 2kRAM)
NUC029FAE.menu.cpu.FAE.build.extra_flags=-DCHIP20P
NUC029FAE.menu.cpu.FAE.build.board=GENERIC_NUC029FAE
NUC029FAE.menu.cpu.FAE.build.ldscript=16K_2K_flash_S.ld
NUC029FAE.menu.cpu.FAE.upload.maximum_size=16384
NUC029FAE.menu.cpu.FAE.upload.maximum_data_size=2048
NUC029FAE.menu.cpu.FAE.upload.device=NUC029FAE

NUC029FAE.menu.clock_source.HXT1=HXT_12M(72MMHz)
NUC029FAE.menu.clock_source.HXT1.build.f_cpu=72000000L -DHXT12
NUC029FAE.menu.clock_source.HIRC=HIRC_22M(72MHz)
NUC029FAE.menu.clock_source.HIRC.build.f_cpu=72000000L -DHIRC

NUC029FAE.menu.serial.UART0=Serial0(P1_3/2)
NUC029FAE.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NUC029FAE.menu.serial.NuICE=Nulink console
NUC029FAE.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
NUC029FAE.menu.serial.NuICE.upload.console=NUCONSOLE

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NUC029FAE.menu.log.default=Release(no-exceptions)
NUC029FAE.menu.log.default.build.log_level=-fno-exceptions
NUC029FAE.menu.log.Release=Release(exceptions)
NUC029FAE.menu.log.fatal=FATAL
NUC029FAE.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
NUC029FAE.menu.log.error=ERROR
NUC029FAE.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
NUC029FAE.menu.log.warning=WARNING
NUC029FAE.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
NUC029FAE.menu.log.info=INFO
NUC029FAE.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
NUC029FAE.menu.log.debug=DEBUG
NUC029FAE.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
NUC029FAE.menu.log.trace=TRACE
NUC029FAE.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

NUC029FAE.menu.upload_method.nulink=Nulink
NUC029FAE.menu.upload_method.nulink.upload.tool=nulinkburn
NUC029FAE.menu.upload_method.nulink.upload.protocol=nuc-ba
NUC029FAE.menu.upload_method.nulink.upload.use_1200bps_touch=false
NUC029FAE.menu.upload_method.nulink.upload.wait_for_upload_port=false
NUC029FAE.menu.upload_method.nulink.upload.native_usb=false

NUC029FAE.menu.upload_method.jLinkMethod=JLink
NUC029FAE.menu.upload_method.jLinkMethod.upload.tool=jlinkob_upload
NUC029FAE.menu.upload_method.jLinkMethod.upload.protocol=jlink


########################################################
#                      NUC029xDE                       #
########################################################
NUC029xDE.name=NUC029xDE

NUC029xDE.build.core=nuvoton
NUC029xDE.build.mcu=cortex-m0
NUC029xDE.build.f_cpu=72000000L
NUC029xDE.build.series=NUC029xDE
NUC029xDE.build.variant=NUC029xDE
NUC029xDE.build.board=NUC029SDE

NUC029xDE.menu.cpu.SDE=NuTiny_NUC029SDE(LQP64)(64kFLASH 8kRAM)
NUC029xDE.menu.cpu.SDE.build.extra_flags=-DCHIP64P -DLED_BUILTIN=PB_13
NUC029xDE.menu.cpu.SDE.build.board=NUC029SDE
NUC029xDE.menu.cpu.SDE.build.ldscript=64K_8K_flash_S.ld
NUC029xDE.menu.cpu.SDE.upload.maximum_size=65536
NUC029xDE.menu.cpu.SDE.upload.maximum_data_size=8192
NUC029xDE.menu.cpu.SDE.upload.device=NUC029SDE

NUC029xDE.menu.cpu.LDE=GENERIC_NUC029LDE(LQP48)(64kFLASH 8kRAM)
NUC029xDE.menu.cpu.LDE.build.extra_flags=-DCHIP48P -DLED_BUILTIN=PB_12
NUC029xDE.menu.cpu.LDE.build.board=NUC029LDE
NUC029xDE.menu.cpu.LDE.build.ldscript=64K_8K_flash_S.ld
NUC029xDE.menu.cpu.LDE.upload.maximum_size=65536
NUC029xDE.menu.cpu.LDE.upload.maximum_data_size=8192
NUC029xDE.menu.cpu.LDE.upload.device=NUC029LDE

