huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
NUC029xDE.menu.clock_source.HIRC=HIRC_22M(72MHz)
NUC029xDE.menu.clock_source.HIRC.build.f_cpu=72000000L -DHIRC
NUC029xDE.menu.clock_source.HXT1=HXT_12M(72MMHz)
NUC029xDE.menu.clock_source.HXT1.build.f_cpu=72000000L -DHXT12

NUC029xDE.menu.serial.UART0=Serial0(PA_3/2)
NUC029xDE.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NUC029xDE.menu.serial.NuICE=Nulink console
NUC029xDE.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
NUC029xDE.menu.serial.NuICE.upload.console=NUCONSOLE

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NUC029xDE.menu.log.default=Release(no-exceptions)
NUC029xDE.menu.log.default.build.log_level=-fno-exceptions
NUC029xDE.menu.log.Release=Release(exceptions)
NUC029xDE.menu.log.fatal=FATAL
NUC029xDE.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
NUC029xDE.menu.log.error=ERROR
NUC029xDE.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
NUC029xDE.menu.log.warning=WARNING
NUC029xDE.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
NUC029xDE.menu.log.info=INFO
NUC029xDE.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
NUC029xDE.menu.log.debug=DEBUG
NUC029xDE.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
NUC029xDE.menu.log.trace=TRACE
NUC029xDE.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

NUC029xDE.menu.upload_method.nulink=Nulink
NUC029xDE.menu.upload_method.nulink.upload.tool=nulinkburn
NUC029xDE.menu.upload_method.nulink.upload.protocol=nuc-ba
NUC029xDE.menu.upload_method.nulink.upload.use_1200bps_touch=false
NUC029xDE.menu.upload_method.nulink.upload.wait_for_upload_port=false
NUC029xDE.menu.upload_method.nulink.upload.native_usb=false

NUC029xDE.menu.upload_method.jLinkMethod=JLink
NUC029xDE.menu.upload_method.jLinkMethod.upload.tool=jlinkob_upload
NUC029xDE.menu.upload_method.jLinkMethod.upload.protocol=jlink

########################################################
#                      NUC029xEE                       #
########################################################
NUC029xEE.name=NUC029xEE

NUC029xEE.build.core=nuvoton
NUC029xEE.build.mcu=cortex-m0
NUC029xEE.build.f_cpu=72000000L
NUC029xEE.build.series=NUC029xEE
NUC029xEE.build.variant=NUC029xEE
NUC029xEE.build.board=NUC029SEE

NUC029xEE.menu.cpu.SEE=NuTiny_NUC029SE(LQP64)(128kFLASH 16kRAM)
NUC029xEE.menu.cpu.SEE.build.extra_flags=-DCHIP64P
NUC029xEE.menu.cpu.SEE.build.board=NUC029SEE
NUC029xEE.menu.cpu.SEE.build.ldscript=128K_16K_flash_S.ld
NUC029xEE.menu.cpu.SEE.upload.maximum_size=131072
NUC029xEE.menu.cpu.SEE.upload.maximum_data_size=16384
NUC029xEE.menu.cpu.SEE.upload.device=NUC029SEE

NUC029xEE.menu.cpu.LEE=GENERIC_NUC029LEE(LQP48)(128kFLASH 16kRAM)
NUC029xEE.menu.cpu.LEE.build.extra_flags=-DCHIP48P
NUC029xEE.menu.cpu.LEE.build.board=NUC029LEE
NUC029xEE.menu.cpu.LEE.build.ldscript=128K_16K_flash_S.ld
NUC029xEE.menu.cpu.LEE.upload.maximum_size=131072
NUC029xEE.menu.cpu.LEE.upload.maximum_data_size=16384
NUC029xEE.menu.cpu.LEE.upload.device=NUC029LEE

NUC029xEE.menu.clock_source.HXT1=HXT_12M(72MMHz)
NUC029xEE.menu.clock_source.HXT1.build.f_cpu=72000000L -DHXT12
NUC029xEE.menu.clock_source.HIRC=HIRC_22M(72MHz)
NUC029xEE.menu.clock_source.HIRC.build.f_cpu=72000000L -DHIRC

NUC029xEE.menu.serial.UART0=Serial0(PB_0/1)
NUC029xEE.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NUC029xEE.menu.serial.UART1=Serial1(PB_4/5)
NUC029xEE.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NUC029xEE.menu.serial.UART2=Serial2(PB_9/10)
NUC029xEE.menu.serial.UART3.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NUC029xEE.menu.serial.NuICE=Nulink console
NUC029xEE.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
NUC029xEE.menu.serial.NuICE.upload.console=NUCONSOLE

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NUC029xEE.menu.log.default=Release(no-exceptions)
NUC029xEE.menu.log.default.build.log_level=-fno-exceptions
NUC029xEE.menu.log.Release=Release(exceptions)
NUC029xEE.menu.log.fatal=FATAL
NUC029xEE.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
NUC029xEE.menu.log.error=ERROR
NUC029xEE.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
NUC029xEE.menu.log.warning=WARNING
NUC029xEE.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
NUC029xEE.menu.log.info=INFO
NUC029xEE.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
NUC029xEE.menu.log.debug=DEBUG
NUC029xEE.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
NUC029xEE.menu.log.trace=TRACE
NUC029xEE.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

NUC029xEE.menu.upload_method.nulink=Nulink
NUC029xEE.menu.upload_method.nulink.upload.tool=nulinkburn
NUC029xEE.menu.upload_method.nulink.upload.protocol=nuc-ba
NUC029xEE.menu.upload_method.nulink.upload.use_1200bps_touch=false
NUC029xEE.menu.upload_method.nulink.upload.wait_for_upload_port=false
NUC029xEE.menu.upload_method.nulink.upload.native_usb=false

NUC029xEE.menu.upload_method.jLinkMethod=JLink
NUC029xEE.menu.upload_method.jLinkMethod.upload.tool=jlinkob_upload
NUC029xEE.menu.upload_method.jLinkMethod.upload.protocol=jlink

########################################################
#                      NUC029xGE                       #
########################################################
NUC029xGE.name=NUC029xGE
NUC029xGE.vid.0=0x0416
NUC029xGE.pid.0=0x511D

NUC029xGE.build.core=nuvoton
NUC029xGE.build.mcu=cortex-m0
NUC029xGE.build.f_cpu=72000000L
NUC029xGE.build.series=NUC029xGE
NUC029xGE.build.variant=NUC029xGE
NUC029xGE.build.board=NUC029SGE

NUC029xGE.menu.cpu.SGE=NuTiny_NUC029SGE(LQP64)(256kFLASH 20kRAM)
NUC029xGE.menu.cpu.SGE.build.extra_flags=-DCHIP64P
NUC029xGE.menu.cpu.SGE.build.board=NuTiny_NUC029SGE
NUC029xGE.menu.cpu.SGE.build.ldscript=256K_20K_flash_S.ld
NUC029xGE.menu.cpu.SGE.upload.maximum_size=262144
NUC029xGE.menu.cpu.SGE.upload.maximum_data_size=20480
NUC029xGE.menu.cpu.SGE.upload.device=NUC029SGE

