huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
NUC029xGE.menu.cpu.LGE=GENERIC_NUC029LGE(LQP48)(256kFLASH 20kRAM)
NUC029xGE.menu.cpu.LGE.build.extra_flags=-DCHIP48P -DLED_BUILTIN=PB_5
NUC029xGE.menu.cpu.LGE.build.board=NUC029LGE
NUC029xGE.menu.cpu.LGE.build.ldscript=256K_20K_flash_S.ld
NUC029xGE.menu.cpu.LGE.upload.maximum_size=262144
NUC029xGE.menu.cpu.LGE.upload.maximum_data_size=20480
NUC029xGE.menu.cpu.LGE.upload.device=NUC029LGE

NUC029xGE.menu.clock_source.HXT1=HXT_12M(72MMHz)
NUC029xGE.menu.clock_source.HXT1.build.f_cpu=72000000L -DHXT12
NUC029xGE.menu.clock_source.HIRC=HIRC_22M(72MMHz)
NUC029xGE.menu.clock_source.HIRC.build.f_cpu=72000000L -DHIRC

NUC029xGE.menu.serial.UART0=Serial0(PA_3/2)
NUC029xGE.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NUC029xGE.menu.serial.UART1=Serial1(PA_1/0)
NUC029xGE.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
NUC029xGE.menu.serial.UART2=Serial2(PB_0/1)
NUC029xGE.menu.serial.UART2.build.extra_flags_serial=-DMENU_SERIAL=Serial2
NUC029xGE.menu.serial.NuICE=Nulink console
NUC029xGE.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
NUC029xGE.menu.serial.NuICE.upload.console=NUCONSOLE

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NUC029xGE.menu.log.default=Release(no-exceptions)
NUC029xGE.menu.log.default.build.log_level=-fno-exceptions
NUC029xGE.menu.log.Release=Release(exceptions)
NUC029xGE.menu.log.fatal=FATAL
NUC029xGE.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
NUC029xGE.menu.log.error=ERROR
NUC029xGE.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
NUC029xGE.menu.log.warning=WARNING
NUC029xGE.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
NUC029xGE.menu.log.info=INFO
NUC029xGE.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
NUC029xGE.menu.log.debug=DEBUG
NUC029xGE.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
NUC029xGE.menu.log.trace=TRACE
NUC029xGE.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

NUC029xGE.menu.upload_method.nulink=Nulink
NUC029xGE.menu.upload_method.nulink.upload.tool=nulinkburn
NUC029xGE.menu.upload_method.nulink.upload.protocol=nuc-ba
NUC029xGE.menu.upload_method.nulink.upload.use_1200bps_touch=false
NUC029xGE.menu.upload_method.nulink.upload.wait_for_upload_port=false
NUC029xGE.menu.upload_method.nulink.upload.native_usb=false

NUC029xGE.menu.upload_method.jLinkMethod=JLink
NUC029xGE.menu.upload_method.jLinkMethod.upload.tool=jlinkob_upload
NUC029xGE.menu.upload_method.jLinkMethod.upload.protocol=jlink

############################################### The end ##########################################
